#include <iostream>
using namespace std;
int main()
{
	
	//18. Задано натуральное число N.Найти количество натуральных чисел, не превосходящих N и не делящихся ни на одно из чисел 2, 3, 5.

	/*int i, N, K;
	k = 0;
	i = 1;
	cin >> N;
	while (i <= N) {
		if (i % 2 != 0 && i % 3 != 0 && i % 5 != 0) {
			K++;
		}
		i += 1;
	}
	cout << K;
	 Задача 1 
	int i;
	i = 1;
	while (i <= 98) {
		if (i % 7 == 0) {
			cout << i << " ";
		}
		i += 1;
	}
	19. Два двузначных числа, записанных одно за другим, образуют четырёхзначное число, которое делится на их произведение.Найти эти числа.*/
	/*int a,b,c;
	a = 9;
	while (a <= 99 ) {
		a++;
		b = 10;
		while (b <= 99) {
			c = a * 100 + b;
			
			if (c % (a * b) == 0) {
				cout << c << " ";
			}
			
			b++;
		}
		
	}
	//Задача 5 
	int i, a, b;
	cin >> a >> b;
	i = b;
	while (a <= i) {
		if (i % 7 == 0) {
			cout << i << " ";
		}
		i--;
	}
	Задача 4
	
	int i, a, b;
	cin >> a >> b;
	i = a;
	while (i <= b) {
		if (i % 9 == 2 || i % 9 == 3) {
			cout << i << " ";
		}
		i++;
	}
	22. дано натуральное n. вычислить: 1 + 1/2 + 1/3 + 1/4 + ... + 1/n. */
    double N, f;
	f = 1;
	cin >> N;
	double i = 1;
	while (i <= N) {
		f += 1 / i;
		i++;
	}
	cout << f << endl;


}